//問題
const quiz = [
  {
    question:'情報システム戦略の立案にあたり、必ず考慮すべき事項はどれか',
    selects:[
     '開発期間の短縮方法を検討する',
     '経営戦略との整合性を図る',
     'コストの削減方法を検討する',
     '最新技術の導入を計画する'
    ],
    answer:'経営戦略との整合性を図る'
  },{
    question:'SFAの目的に関する記述として、適切なものはどれか',
    selects:[
     '営業活動で入手した市場ニーズに対応して、製品の改良を図る',
     '他の優れた企業の業績や組織の分析を通じて、自社の営業組織の見直しを図る',
     '蓄積された知識やノウハウを組織全体で共有し、営業活動の効率と管理水準の向上を図る',
     '販売情報を基に、資材の調達から生産、流通、販売までの一連のプロセスを改善して全体の在庫の最適化を図る'
    ],
    answer:'蓄積された知識やノウハウを組織全体で共有し、営業活動の効率と管理水準の向上を図る',
  },{
    question: 'EA（Enterprise Architecture）で用いられる、現状とあるべき姿を比較して課題を明確にする分析手法はどれか',
    selects: [
     'ギャップ分析',
     'コアコンピタンス分析',
     'バリューチェーン分析',
     'パレート分析'
    ],
    answer:'ギャップ分析'
  },{
    question: 'DFDの表記に関する記述として、最も適切なものはどれか',
    selects: [
     '時間の経過や現状の変化に伴う、システムの状態の遷移を表記する',
     'システムで扱う実態同士を関連付けて、データの構造を表記する',
     'システムを校正する要素の属性や操作、要素同士の関係を表記する',
     'データの流れに注目し、業務のデータの流れと処理の関係を表記する'
    ],
    answer:'データの流れに注目し、業務のデータの流れと処理の関係を表記する'
  },{
    question: 'A社では、受注から納品までの期間が、従来に比べて長くかかるようになった。原因は、各部門の業務の細分化と専門化が進んだことによって、受注から出荷までの工程数が増え、工程間の待ち時間も増えたからである。経営戦略として、リードタイムの短縮とコストの削減を実現するために社内の業務プロセスを抜本的に見直したいとき、適用する手法として、適切なものはどれか',
    selects: [
     'BCM',
     'BPR',
     'CRM',
     'SFA'
    ],
    answer:'BPR'
  },{
    question: 'RPA（Robot Process Automation）に関する記述として、最も適切なものはどれか',
    selects: [
     'ホワイトカラーの定型的な事務作業を、ソフトウェアで実現されたロボットに代替させることによって、自動化や効率化を図る',
     'システムの利用者が、主体的にシステム管理や運用を行うことによって利用者のITリテラシの向上や、システムベンダへの依存の軽減などを実現する',
     '組み立てや搬送などにハードウェアのロボットを用いることによって、工場の生産活動の自動化を実現する',
     '企業の一部の業務を外部の組織に委託することによって、自社のリソースを重要な領域に集中したり、コストの最適化や業務の高効率化などを実現したりする'
    ],
    answer:'ホワイトカラーの定型的な事務作業を、ソフトウェアで実現されたロボットに代替させることによって、自動化や効率化を図る'
  },{
    question: 'BYODの説明として、適切なものはどれか',
    selects: [
     '企業などにおいて、従業員が私物の情報端末を自社のネットワークに接続するなどして、業務で利用できるようにすること',
     '業務プロセスを抜本的に改革し、ITを駆使して業務の処理能力とコスト効率を高めること',
     '事故や災害が発生した場合でも、安定的に業務を遂行できるようにするための事業継続計画の事',
     '自社の教務プロセスの一部を、子会社や外部の専門的な企業に委託し、業務の効率化を図ること'
    ],
    answer:'企業などにおいて、従業員が私物の情報端末を自社のネットワークに接続するなどして、業務で利用できるようにすること'
  },{
    question: '電子メール、電子掲示板を介したコミュニケーション、情報共有、電子会議などの各種機能を有し、共同作業環境を提供するソフトウェアを何と呼ぶか',
    selects: [
     'グループウェア',
     'シェアウェア',
     'ファームウェア',
     'フリーウェア'
    ],
    answer:'グループウェア'
  },{
    question: 'SNSNをマーケティングに活用した事例として、最も適切なものはどれか',
    selects: [
     'インターネットで注文された商品の引き渡しとその代金の受け取りを支障なく行う',
     '書き込み機能を利用して、登録会員に自社商品の評価内容を記載してもらう',
     '検索エンジンによる検索結果の上位に自社サイトを表示させて、訪問者増を狙う',
     '同業他社よりも安い価格を設定して、顧客の購入意欲を高める'
    ],
    answer:'書き込み機能を利用して、登録会員に自社商品の評価内容を記載してもらう'
  },{
    question: '”クラウドコンピューティング”に関する記述として、適切なものはどれか',
    selects: [
     'インターネットの通信プロトコル',
     'コンピュータ資源の提供に関するサービスモデル',
     '仕様変更に柔軟に対応できるソフトウェア開発の手法',
     '電子商取引などに使われる電子データ交換の企画'
    ],
    answer:'コンピュータ資源の提供に関するサービスモデル'
  },{
    question: 'SaaSの説明として、最も適切なものはどれか',
    selects: [
     'インターネットへの接続サービスを提供する',
     'システムの稼働に必要な規模のハードウェア機能を、サービスとしてネットワーク経由で提供する',
     'ハードウェア機能に加えて、OSやデータベースソフトウェアなど、アプリケーションソフトウェアの稼働に必要な基盤をネットワーク経由で提供する',
     '利用者に対して、アプリケーションソフトウェアの必要な機能だけを必要な時に、ネットワーク経由で提供する'
    ],
    answer:'利用者に対して、アプリケーションソフトウェアの必要な機能だけを必要な時に、ネットワーク経由で提供する'
  },{
    question: '自社の情報システムを、自社が管理する設備内に導入して運用する形態を代表する用語はどれ',
    selects: [
     'アウトソーシング',
     'オンプレミス',
     'クラウドコンピューティング',
     'グリッドコンピューティング'
    ],
    answer:'オンプレミス'
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  },{
    question: '',
    selects: [
     '',
     '',
     '',
     ''
    ],
    answer:''
  }
]

const quizLength = quiz.length;
let quizIndex = 0;
let score = 0;


//ボタン読み込み
const $button = document.getElementsByTagName("button");
const buttonLength = $button.length;

//問題文
const selectQuiz = () => {
  document.getElementById('question').textContent = quiz[quizIndex].question;
  let buttonIndex = 0;
  while(buttonIndex < buttonLength){
   $button[buttonIndex].textContent = quiz[quizIndex].selects[buttonIndex];
   buttonIndex++;
  };
};
selectQuiz();


//正誤判定
const clickCheck = (e) => {
  if(quiz[quizIndex].answer === e.target.textContent){
    window.alert('正解');
    score++;
    } else {
    window.alert('不正解');
    }
    quizIndex++;
    if(quizIndex < quizLength){
     selectQuiz();
    } else {
     window.alert('終了あなたの結果は' + score + '/' + quizLength + 'です！');
    }
};
let checkIndex = 0;
while(checkIndex < buttonLength){
  $button[checkIndex].addEventListener('click',(e) => {
    clickCheck(e);
  });
 checkIndex++;
};

